Oru-Soap-Servisas/src/main/resources/locationRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="com/locations">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getgetWeatherRequest>
            <us:id>1</us:id>
        </us:getgetWeatherRequest>
    </soapenv:Body>
</soapenv:Envelope>